;******************************************************************************
;* TMS320C6x C/C++ Codegen                                          PC v7.4.8 *
;* Date/Time created: Mon Sep 12 07:22:28 2016                                *
;******************************************************************************
	.compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_precision_bits=32 --mem_model:code=near --mem_model:const=data --mem_model:data=far_aggregates --object_format=elf --silicon_version=6740 --symdebug:dwarf --symdebug:dwarf_version=3 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C674x                                          *
;*   Optimization      : Enabled at level 3                                   *
;*   Optimizing for    : Speed                                                *
;*                       Based on options: -o3, no -ms                        *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far Aggregate Data                                   *
;*   Pipelining        : Enabled                                              *

	.dwattr $C$DW$618, DW_AT_decl_column(0x05)
$C$DW$619	.dwtag  DW_TAG_enumerator, DW_AT_name("EDMA3_DRV_IOCTL_SET_PARAM_CLEAR_OPTION"), DW_AT_const_value(0x01)
	.dwattr $C$DW$619, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$619, DW_AT_decl_line(0xab4)
	.dwattr $C$DW$619, DW_AT_decl_column(0x05)
$C$DW$620	.dwtag  DW_TAG_enumerator, DW_AT_name("EDMA3_DRV_IOCTL_GET_PARAM_CLEAR_OPTION"), DW_AT_const_value(0x02)
	.dwattr $C$DW$620, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$620, DW_AT_decl_line(0xac1)
	.dwattr $C$DW$620, DW_AT_decl_column(0x05)
$C$DW$621	.dwtag  DW_TAG_enumerator, DW_AT_name("EDMA3_DRV_IOCTL_MAX_IOCTL"), DW_AT_const_value(0x03)
	.dwattr $C$DW$621, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$621, DW_AT_decl_line(0xac4)
	.dwattr $C$DW$621, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$616

	.dwattr $C$DW$T$616, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$616, DW_AT_decl_line(0xa9c)
	.dwattr $C$DW$T$616, DW_AT_decl_column(0x01)
$C$DW$T$617	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_DRV_IoctlCmd")
	.dwattr $C$DW$T$617, DW_AT_type(*$C$DW$T$616)
	.dwattr $C$DW$T$617, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$617, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$617, DW_AT_decl_line(0xac5)
	.dwattr $C$DW$T$617, DW_AT_decl_column(0x03)

$C$DW$T$618	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$618, DW_AT_byte_size(0x04)
$C$DW$622	.dwtag  DW_TAG_enumerator, DW_AT_name("EDMA3_DRV_TC_ERR_BUSERR_DIS"), DW_AT_const_value(0x00)
	.dwattr $C$DW$622, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$622, DW_AT_decl_line(0xb58)
	.dwattr $C$DW$622, DW_AT_decl_column(0x02)
$C$DW$623	.dwtag  DW_TAG_enumerator, DW_AT_name("EDMA3_DRV_TC_ERR_BUSERR_EN"), DW_AT_const_value(0x01)
	.dwattr $C$DW$623, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$623, DW_AT_decl_line(0xb5d)
	.dwattr $C$DW$623, DW_AT_decl_column(0x02)
$C$DW$624	.dwtag  DW_TAG_enumerator, DW_AT_name("EDMA3_DRV_TC_ERR_TRERR_DIS"), DW_AT_const_value(0x02)
	.dwattr $C$DW$624, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$624, DW_AT_decl_line(0xb62)
	.dwattr $C$DW$624, DW_AT_decl_column(0x02)
$C$DW$625	.dwtag  DW_TAG_enumerator, DW_AT_name("EDMA3_DRV_TC_ERR_TRERR_EN"), DW_AT_const_value(0x03)
	.dwattr $C$DW$625, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$625, DW_AT_decl_line(0xb67)
	.dwattr $C$DW$625, DW_AT_decl_column(0x02)
$C$DW$626	.dwtag  DW_TAG_enumerator, DW_AT_name("EDMA3_DRV_TC_ERR_MMRAERR_DIS"), DW_AT_const_value(0x04)
	.dwattr $C$DW$626, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$626, DW_AT_decl_line(0xb6c)
	.dwattr $C$DW$626, DW_AT_decl_column(0x02)
$C$DW$627	.dwtag  DW_TAG_enumerator, DW_AT_name("EDMA3_DRV_TC_ERR_MMRAERR_EN"), DW_AT_const_value(0x05)
	.dwattr $C$DW$627, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$627, DW_AT_decl_line(0xb71)
	.dwattr $C$DW$627, DW_AT_decl_column(0x02)
$C$DW$628	.dwtag  DW_TAG_enumerator, DW_AT_name("EDMA3_DRV_TC_ERR_DIS"), DW_AT_const_value(0x06)
	.dwattr $C$DW$628, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$628, DW_AT_decl_line(0xb76)
	.dwattr $C$DW$628, DW_AT_decl_column(0x02)
$C$DW$629	.dwtag  DW_TAG_enumerator, DW_AT_name("EDMA3_DRV_TC_ERR_EN"), DW_AT_const_value(0x07)
	.dwattr $C$DW$629, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$629, DW_AT_decl_line(0xb7b)
	.dwattr $C$DW$629, DW_AT_decl_column(0x02)
	.dwendtag $C$DW$T$618

	.dwattr $C$DW$T$618, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$618, DW_AT_decl_line(0xb54)
	.dwattr $C$DW$T$618, DW_AT_decl_column(0x01)
$C$DW$T$619	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_DRV_Tc_Err")
	.dwattr $C$DW$T$619, DW_AT_type(*$C$DW$T$618)
	.dwattr $C$DW$T$619, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$619, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$619, DW_AT_decl_line(0xb7c)
	.dwattr $C$DW$T$619, DW_AT_decl_column(0x03)

$C$DW$T$139	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$139, DW_AT_byte_size(0x20)
$C$DW$630	.dwtag  DW_TAG_member
	.dwattr $C$DW$630, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$630, DW_AT_name("opt")
	.dwattr $C$DW$630, DW_AT_TI_symbol_name("opt")
	.dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$630, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$630, DW_AT_decl_line(0x899)
	.dwattr $C$DW$630, DW_AT_decl_column(0x1b)
$C$DW$631	.dwtag  DW_TAG_member
	.dwattr $C$DW$631, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$631, DW_AT_name("srcAddr")
	.dwattr $C$DW$631, DW_AT_TI_symbol_name("srcAddr")
	.dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$631, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$631, DW_AT_decl_line(0x89f)
	.dwattr $C$DW$631, DW_AT_decl_column(0x1b)
$C$DW$632	.dwtag  DW_TAG_member
	.dwattr $C$DW$632, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$632, DW_AT_name("aCnt")
	.dwattr $C$DW$632, DW_AT_TI_symbol_name("aCnt")
	.dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$632, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$632, DW_AT_decl_line(0x8a4)
	.dwattr $C$DW$632, DW_AT_decl_column(0x1b)
$C$DW$633	.dwtag  DW_TAG_member
	.dwattr $C$DW$633, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$633, DW_AT_name("bCnt")
	.dwattr $C$DW$633, DW_AT_TI_symbol_name("bCnt")
	.dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$633, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$633, DW_AT_decl_line(0x8a9)
	.dwattr $C$DW$633, DW_AT_decl_column(0x1b)
$C$DW$634	.dwtag  DW_TAG_member
	.dwattr $C$DW$634, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$634, DW_AT_name("destAddr")
	.dwattr $C$DW$634, DW_AT_TI_symbol_name("destAddr")
	.dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$634, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$634, DW_AT_decl_line(0x8b0)
	.dwattr $C$DW$634, DW_AT_decl_column(0x1b)
$C$DW$635	.dwtag  DW_TAG_member
	.dwattr $C$DW$635, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$635, DW_AT_name("srcBIdx")
	.dwattr $C$DW$635, DW_AT_TI_symbol_name("srcBIdx")
	.dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$635, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$635, DW_AT_decl_line(0x8b7)
	.dwattr $C$DW$635, DW_AT_decl_column(0x1b)
$C$DW$636	.dwtag  DW_TAG_member
	.dwattr $C$DW$636, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$636, DW_AT_name("destBIdx")
	.dwattr $C$DW$636, DW_AT_TI_symbol_name("destBIdx")
	.dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$636, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$636, DW_AT_decl_line(0x8be)
	.dwattr $C$DW$636, DW_AT_decl_column(0x1b)
$C$DW$637	.dwtag  DW_TAG_member
	.dwattr $C$DW$637, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$637, DW_AT_name("linkAddr")
	.dwattr $C$DW$637, DW_AT_TI_symbol_name("linkAddr")
	.dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$637, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$637, DW_AT_decl_line(0x8c7)
	.dwattr $C$DW$637, DW_AT_decl_column(0x1b)
$C$DW$638	.dwtag  DW_TAG_member
	.dwattr $C$DW$638, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$638, DW_AT_name("bCntReload")
	.dwattr $C$DW$638, DW_AT_TI_symbol_name("bCntReload")
	.dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$638, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$638, DW_AT_decl_line(0x8cd)
	.dwattr $C$DW$638, DW_AT_decl_column(0x1b)
$C$DW$639	.dwtag  DW_TAG_member
	.dwattr $C$DW$639, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$639, DW_AT_name("srcCIdx")
	.dwattr $C$DW$639, DW_AT_TI_symbol_name("srcCIdx")
	.dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$639, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$639, DW_AT_decl_line(0x8d2)
	.dwattr $C$DW$639, DW_AT_decl_column(0x1b)
$C$DW$640	.dwtag  DW_TAG_member
	.dwattr $C$DW$640, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$640, DW_AT_name("destCIdx")
	.dwattr $C$DW$640, DW_AT_TI_symbol_name("destCIdx")
	.dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$640, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$640, DW_AT_decl_line(0x8d7)
	.dwattr $C$DW$640, DW_AT_decl_column(0x1b)
$C$DW$641	.dwtag  DW_TAG_member
	.dwattr $C$DW$641, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$641, DW_AT_name("cCnt")
	.dwattr $C$DW$641, DW_AT_TI_symbol_name("cCnt")
	.dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$641, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$641, DW_AT_decl_line(0x8dc)
	.dwattr $C$DW$641, DW_AT_decl_column(0x1b)
$C$DW$642	.dwtag  DW_TAG_member
	.dwattr $C$DW$642, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$642, DW_AT_name("reserved")
	.dwattr $C$DW$642, DW_AT_TI_symbol_name("reserved")
	.dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$642, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$642, DW_AT_decl_line(0x8e1)
	.dwattr $C$DW$642, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$139

	.dwattr $C$DW$T$139, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$139, DW_AT_decl_line(0x897)
	.dwattr $C$DW$T$139, DW_AT_decl_column(0x11)
$C$DW$T$621	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_DRV_PaRAMRegs")
	.dwattr $C$DW$T$621, DW_AT_type(*$C$DW$T$139)
	.dwattr $C$DW$T$621, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$621, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$621, DW_AT_decl_line(0x8e2)
	.dwattr $C$DW$T$621, DW_AT_decl_column(0x03)
$C$DW$T$622	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$622, DW_AT_type(*$C$DW$T$621)
$C$DW$T$623	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$623, DW_AT_type(*$C$DW$T$622)
	.dwattr $C$DW$T$623, DW_AT_address_class(0x20)

$C$DW$T$142	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$142, DW_AT_byte_size(0x08)
$C$DW$643	.dwtag  DW_TAG_member
	.dwattr $C$DW$643, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$643, DW_AT_name("length")
	.dwattr $C$DW$643, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$643, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/bios_6_34_02_18/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$643, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$643, DW_AT_decl_column(0x16)
$C$DW$644	.dwtag  DW_TAG_member
	.dwattr $C$DW$644, DW_AT_type(*$C$DW$T$141)
	.dwattr $C$DW$644, DW_AT_name("elem")
	.dwattr $C$DW$644, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$644, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/bios_6_34_02_18/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$644, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$644, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$142

	.dwattr $C$DW$T$142, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/bios_6_34_02_18/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$142, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$T$142, DW_AT_decl_column(0x10)
$C$DW$T$625	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$625, DW_AT_type(*$C$DW$T$142)
	.dwattr $C$DW$T$625, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$625, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/bios_6_34_02_18/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$625, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$T$625, DW_AT_decl_column(0x42)
$C$DW$T$626	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$626, DW_AT_type(*$C$DW$T$625)
	.dwattr $C$DW$T$626, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$626, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/bios_6_34_02_18/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$626, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$626, DW_AT_decl_column(0x2b)
$C$DW$T$627	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$627, DW_AT_type(*$C$DW$T$626)
	.dwattr $C$DW$T$627, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$627, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/bios_6_34_02_18/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$627, DW_AT_decl_line(0xea)
	.dwattr $C$DW$T$627, DW_AT_decl_column(0x27)

$C$DW$T$145	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$145, DW_AT_byte_size(0x08)
$C$DW$645	.dwtag  DW_TAG_member
	.dwattr $C$DW$645, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$645, DW_AT_name("length")
	.dwattr $C$DW$645, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$645, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/bios_6_34_02_18/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$645, DW_AT_decl_line(0x195)
	.dwattr $C$DW$645, DW_AT_decl_column(0x16)
$C$DW$646	.dwtag  DW_TAG_member
	.dwattr $C$DW$646, DW_AT_type(*$C$DW$T$144)
	.dwattr $C$DW$646, DW_AT_name("elem")
	.dwattr $C$DW$646, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$646, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/bios_6_34_02_18/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$646, DW_AT_decl_line(0x195)
	.dwattr $C$DW$646, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$145

	.dwattr $C$DW$T$145, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/bios_6_34_02_18/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$145, DW_AT_decl_line(0x195)
	.dwattr $C$DW$T$145, DW_AT_decl_column(0x10)
$C$DW$T$628	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$628, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$T$628, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$628, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/bios_6_34_02_18/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$628, DW_AT_decl_line(0x195)
	.dwattr $C$DW$T$628, DW_AT_decl_column(0x43)
$C$DW$T$629	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$629, DW_AT_type(*$C$DW$T$628)
	.dwattr $C$DW$T$629, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$629, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/bios_6_34_02_18/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$629, DW_AT_decl_line(0x196)
	.dwattr $C$DW$T$629, DW_AT_decl_column(0x2c)
$C$DW$T$630	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$630, DW_AT_type(*$C$DW$T$629)
	.dwattr $C$DW$T$630, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$630, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/bios_6_34_02_18/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$630, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$630, DW_AT_decl_column(0x28)

$C$DW$T$151	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$151, DW_AT_byte_size(0x08)
$C$DW$647	.dwtag  DW_TAG_member
	.dwattr $C$DW$647, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$647, DW_AT_name("gblerrCb")
	.dwattr $C$DW$647, DW_AT_TI_symbol_name("gblerrCb")
	.dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$647, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$647, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$647, DW_AT_decl_column(0x21)
$C$DW$648	.dwtag  DW_TAG_member
	.dwattr $C$DW$648, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$648, DW_AT_name("gblerrData")
	.dwattr $C$DW$648, DW_AT_TI_symbol_name("gblerrData")
	.dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$648, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$648, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$648, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$151

	.dwattr $C$DW$T$151, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$T$151, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$T$151, DW_AT_decl_column(0x10)
$C$DW$T$166	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_RM_GblErrCallbackParams")
	.dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$166, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$T$166, DW_AT_decl_line(0xd6)
	.dwattr $C$DW$T$166, DW_AT_decl_column(0x03)

$C$DW$T$154	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$154, DW_AT_byte_size(0x08)
$C$DW$649	.dwtag  DW_TAG_member
	.dwattr $C$DW$649, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$649, DW_AT_name("resId")
	.dwattr $C$DW$649, DW_AT_TI_symbol_name("resId")
	.dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$649, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$649, DW_AT_decl_line(0x124)
	.dwattr $C$DW$649, DW_AT_decl_column(0x0e)
$C$DW$650	.dwtag  DW_TAG_member
	.dwattr $C$DW$650, DW_AT_type(*$C$DW$T$153)
	.dwattr $C$DW$650, DW_AT_name("type")
	.dwattr $C$DW$650, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$650, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$650, DW_AT_decl_line(0x127)
	.dwattr $C$DW$650, DW_AT_decl_column(0x16)
	.dwendtag $C$DW$T$154

	.dwattr $C$DW$T$154, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$T$154, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$T$154, DW_AT_decl_column(0x01)
$C$DW$T$631	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_RM_ResDesc")
	.dwattr $C$DW$T$631, DW_AT_type(*$C$DW$T$154)
	.dwattr $C$DW$T$631, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$631, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$T$631, DW_AT_decl_line(0x128)
	.dwattr $C$DW$T$631, DW_AT_decl_column(0x03)

$C$DW$T$159	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$159, DW_AT_byte_size(0x2d8)
$C$DW$651	.dwtag  DW_TAG_member
	.dwattr $C$DW$651, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$651, DW_AT_name("numDmaChannels")
	.dwattr $C$DW$651, DW_AT_TI_symbol_name("numDmaChannels")
	.dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$651, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$651, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$651, DW_AT_decl_column(0x15)
$C$DW$652	.dwtag  DW_TAG_member
	.dwattr $C$DW$652, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$652, DW_AT_name("numQdmaChannels")
	.dwattr $C$DW$652, DW_AT_TI_symbol_name("numQdmaChannels")
	.dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$652, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$652, DW_AT_decl_line(0x1ec)
	.dwattr $C$DW$652, DW_AT_decl_column(0x15)
$C$DW$653	.dwtag  DW_TAG_member
	.dwattr $C$DW$653, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$653, DW_AT_name("numTccs")
	.dwattr $C$DW$653, DW_AT_TI_symbol_name("numTccs")
	.dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$653, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$653, DW_AT_decl_line(0x1f2)
	.dwattr $C$DW$653, DW_AT_decl_column(0x15)
$C$DW$654	.dwtag  DW_TAG_member
	.dwattr $C$DW$654, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$654, DW_AT_name("numPaRAMSets")
	.dwattr $C$DW$654, DW_AT_TI_symbol_name("numPaRAMSets")
	.dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$654, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$654, DW_AT_decl_line(0x1f5)
	.dwattr $C$DW$654, DW_AT_decl_column(0x15)
$C$DW$655	.dwtag  DW_TAG_member
	.dwattr $C$DW$655, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$655, DW_AT_name("numEvtQueue")
	.dwattr $C$DW$655, DW_AT_TI_symbol_name("numEvtQueue")
	.dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$655, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$655, DW_AT_decl_line(0x1f8)
	.dwattr $C$DW$655, DW_AT_decl_column(0x15)
$C$DW$656	.dwtag  DW_TAG_member
	.dwattr $C$DW$656, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$656, DW_AT_name("numTcs")
	.dwattr $C$DW$656, DW_AT_TI_symbol_name("numTcs")
	.dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$656, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$656, DW_AT_decl_line(0x1fd)
	.dwattr $C$DW$656, DW_AT_decl_column(0x15)
$C$DW$657	.dwtag  DW_TAG_member
	.dwattr $C$DW$657, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$657, DW_AT_name("numRegions")
	.dwattr $C$DW$657, DW_AT_TI_symbol_name("numRegions")
	.dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$657, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$657, DW_AT_decl_line(0x200)
	.dwattr $C$DW$657, DW_AT_decl_column(0x15)
$C$DW$658	.dwtag  DW_TAG_member
	.dwattr $C$DW$658, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$658, DW_AT_name("dmaChPaRAMMapExists")
	.dwattr $C$DW$658, DW_AT_TI_symbol_name("dmaChPaRAMMapExists")
	.dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$658, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$658, DW_AT_decl_line(0x20f)
	.dwattr $C$DW$658, DW_AT_decl_column(0x0f)
$C$DW$659	.dwtag  DW_TAG_member
	.dwattr $C$DW$659, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$659, DW_AT_name("memProtectionExists")
	.dwattr $C$DW$659, DW_AT_TI_symbol_name("memProtectionExists")
	.dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$659, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$659, DW_AT_decl_line(0x212)
	.dwattr $C$DW$659, DW_AT_decl_column(0x0f)
$C$DW$660	.dwtag  DW_TAG_member
	.dwattr $C$DW$660, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$660, DW_AT_name("globalRegs")
	.dwattr $C$DW$660, DW_AT_TI_symbol_name("globalRegs")
	.dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$660, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$660, DW_AT_decl_line(0x215)
	.dwattr $C$DW$660, DW_AT_decl_column(0x1a)
$C$DW$661	.dwtag  DW_TAG_member
	.dwattr $C$DW$661, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$661, DW_AT_name("tcRegs")
	.dwattr $C$DW$661, DW_AT_TI_symbol_name("tcRegs")
	.dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$661, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$661, DW_AT_decl_line(0x218)
	.dwattr $C$DW$661, DW_AT_decl_column(0x1a)
$C$DW$662	.dwtag  DW_TAG_member
	.dwattr $C$DW$662, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$662, DW_AT_name("xferCompleteInt")
	.dwattr $C$DW$662, DW_AT_TI_symbol_name("xferCompleteInt")
	.dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$662, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$662, DW_AT_decl_line(0x21e)
	.dwattr $C$DW$662, DW_AT_decl_column(0x15)
$C$DW$663	.dwtag  DW_TAG_member
	.dwattr $C$DW$663, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$663, DW_AT_name("ccError")
	.dwattr $C$DW$663, DW_AT_TI_symbol_name("ccError")
	.dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$663, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$663, DW_AT_decl_line(0x221)
	.dwattr $C$DW$663, DW_AT_decl_column(0x15)
$C$DW$664	.dwtag  DW_TAG_member
	.dwattr $C$DW$664, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$664, DW_AT_name("tcError")
	.dwattr $C$DW$664, DW_AT_TI_symbol_name("tcError")
	.dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$664, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$664, DW_AT_decl_line(0x224)
	.dwattr $C$DW$664, DW_AT_decl_column(0x15)
$C$DW$665	.dwtag  DW_TAG_member
	.dwattr $C$DW$665, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$665, DW_AT_name("evtQPri")
	.dwattr $C$DW$665, DW_AT_TI_symbol_name("evtQPri")
	.dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$665, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$665, DW_AT_decl_line(0x22f)
	.dwattr $C$DW$665, DW_AT_decl_column(0x15)
$C$DW$666	.dwtag  DW_TAG_member
	.dwattr $C$DW$666, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$666, DW_AT_name("evtQueueWaterMarkLvl")
	.dwattr $C$DW$666, DW_AT_TI_symbol_name("evtQueueWaterMarkLvl")
	.dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$666, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$666, DW_AT_decl_line(0x23b)
	.dwattr $C$DW$666, DW_AT_decl_column(0x15)
$C$DW$667	.dwtag  DW_TAG_member
	.dwattr $C$DW$667, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$667, DW_AT_name("tcDefaultBurstSize")
	.dwattr $C$DW$667, DW_AT_TI_symbol_name("tcDefaultBurstSize")
	.dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
	.dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$667, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$667, DW_AT_decl_line(0x244)
	.dwattr $C$DW$667, DW_AT_decl_column(0x15)
$C$DW$668	.dwtag  DW_TAG_member
	.dwattr $C$DW$668, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$668, DW_AT_name("dmaChannelPaRAMMap")
	.dwattr $C$DW$668, DW_AT_TI_symbol_name("dmaChannelPaRAMMap")
	.dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
	.dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$668, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$668, DW_AT_decl_line(0x251)
	.dwattr $C$DW$668, DW_AT_decl_column(0x15)
$C$DW$669	.dwtag  DW_TAG_member
	.dwattr $C$DW$669, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$669, DW_AT_name("dmaChannelTccMap")
	.dwattr $C$DW$669, DW_AT_TI_symbol_name("dmaChannelTccMap")
	.dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d0]
	.dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$669, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$669, DW_AT_decl_line(0x25c)
	.dwattr $C$DW$669, DW_AT_decl_column(0x15)
$C$DW$670	.dwtag  DW_TAG_member
	.dwattr $C$DW$670, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$670, DW_AT_name("dmaChannelHwEvtMap")
	.dwattr $C$DW$670, DW_AT_TI_symbol_name("dmaChannelHwEvtMap")
	.dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d0]
	.dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$670, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$670, DW_AT_decl_line(0x26a)
	.dwattr $C$DW$670, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$159

	.dwattr $C$DW$T$159, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$T$159, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$T$159, DW_AT_decl_column(0x11)
$C$DW$T$632	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_RM_GblConfigParams")
	.dwattr $C$DW$T$632, DW_AT_type(*$C$DW$T$159)
	.dwattr $C$DW$T$632, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$632, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$T$632, DW_AT_decl_line(0x26b)
	.dwattr $C$DW$T$632, DW_AT_decl_column(0x07)

$C$DW$T$162	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$162, DW_AT_byte_size(0xa8)
$C$DW$671	.dwtag  DW_TAG_member
	.dwattr $C$DW$671, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$671, DW_AT_name("ownPaRAMSets")
	.dwattr $C$DW$671, DW_AT_TI_symbol_name("ownPaRAMSets")
	.dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$671, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$671, DW_AT_decl_line(0x2af)
	.dwattr $C$DW$671, DW_AT_decl_column(0x15)
$C$DW$672	.dwtag  DW_TAG_member
	.dwattr $C$DW$672, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$672, DW_AT_name("ownDmaChannels")
	.dwattr $C$DW$672, DW_AT_TI_symbol_name("ownDmaChannels")
	.dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$672, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$672, DW_AT_decl_line(0x2b2)
	.dwattr $C$DW$672, DW_AT_decl_column(0x15)
$C$DW$673	.dwtag  DW_TAG_member
	.dwattr $C$DW$673, DW_AT_type(*$C$DW$T$161)
	.dwattr $C$DW$673, DW_AT_name("ownQdmaChannels")
	.dwattr $C$DW$673, DW_AT_TI_symbol_name("ownQdmaChannels")
	.dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$673, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$673, DW_AT_decl_line(0x2b5)
	.dwattr $C$DW$673, DW_AT_decl_column(0x15)
$C$DW$674	.dwtag  DW_TAG_member
	.dwattr $C$DW$674, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$674, DW_AT_name("ownTccs")
	.dwattr $C$DW$674, DW_AT_TI_symbol_name("ownTccs")
	.dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$674, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$674, DW_AT_decl_line(0x2b8)
	.dwattr $C$DW$674, DW_AT_decl_column(0x15)
$C$DW$675	.dwtag  DW_TAG_member
	.dwattr $C$DW$675, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$675, DW_AT_name("resvdPaRAMSets")
	.dwattr $C$DW$675, DW_AT_TI_symbol_name("resvdPaRAMSets")
	.dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$675, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$675, DW_AT_decl_line(0x2c1)
	.dwattr $C$DW$675, DW_AT_decl_column(0x15)
$C$DW$676	.dwtag  DW_TAG_member
	.dwattr $C$DW$676, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$676, DW_AT_name("resvdDmaChannels")
	.dwattr $C$DW$676, DW_AT_TI_symbol_name("resvdDmaChannels")
	.dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
	.dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$676, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$676, DW_AT_decl_line(0x2ca)
	.dwattr $C$DW$676, DW_AT_decl_column(0x15)
$C$DW$677	.dwtag  DW_TAG_member
	.dwattr $C$DW$677, DW_AT_type(*$C$DW$T$161)
	.dwattr $C$DW$677, DW_AT_name("resvdQdmaChannels")
	.dwattr $C$DW$677, DW_AT_TI_symbol_name("resvdQdmaChannels")
	.dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
	.dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$677, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$677, DW_AT_decl_line(0x2d3)
	.dwattr $C$DW$677, DW_AT_decl_column(0x15)
$C$DW$678	.dwtag  DW_TAG_member
	.dwattr $C$DW$678, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$678, DW_AT_name("resvdTccs")
	.dwattr $C$DW$678, DW_AT_TI_symbol_name("resvdTccs")
	.dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
	.dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$678, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$678, DW_AT_decl_line(0x2dc)
	.dwattr $C$DW$678, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$162

	.dwattr $C$DW$T$162, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$T$162, DW_AT_decl_line(0x2ad)
	.dwattr $C$DW$T$162, DW_AT_decl_column(0x01)
$C$DW$T$164	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_RM_InstanceInitConfig")
	.dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$T$164, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$164, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$T$164, DW_AT_decl_line(0x2dd)
	.dwattr $C$DW$T$164, DW_AT_decl_column(0x02)
$C$DW$T$165	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$164)
	.dwattr $C$DW$T$165, DW_AT_address_class(0x20)

$C$DW$T$167	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$167, DW_AT_byte_size(0x1c)
$C$DW$679	.dwtag  DW_TAG_member
	.dwattr $C$DW$679, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$679, DW_AT_name("regionId")
	.dwattr $C$DW$679, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$679, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$679, DW_AT_decl_line(0x2e7)
	.dwattr $C$DW$679, DW_AT_decl_column(0x25)
$C$DW$680	.dwtag  DW_TAG_member
	.dwattr $C$DW$680, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$680, DW_AT_name("isMaster")
	.dwattr $C$DW$680, DW_AT_TI_symbol_name("isMaster")
	.dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$680, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$680, DW_AT_decl_line(0x2ee)
	.dwattr $C$DW$680, DW_AT_decl_column(0x20)
$C$DW$681	.dwtag  DW_TAG_member
	.dwattr $C$DW$681, DW_AT_type(*$C$DW$T$165)
	.dwattr $C$DW$681, DW_AT_name("rmInstInitConfig")
	.dwattr $C$DW$681, DW_AT_TI_symbol_name("rmInstInitConfig")
	.dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$681, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$681, DW_AT_decl_line(0x2f8)
	.dwattr $C$DW$681, DW_AT_decl_column(0x26)
$C$DW$682	.dwtag  DW_TAG_member
	.dwattr $C$DW$682, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$682, DW_AT_name("rmSemHandle")
	.dwattr $C$DW$682, DW_AT_TI_symbol_name("rmSemHandle")
	.dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$682, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$682, DW_AT_decl_line(0x2ff)
	.dwattr $C$DW$682, DW_AT_decl_column(0x26)
$C$DW$683	.dwtag  DW_TAG_member
	.dwattr $C$DW$683, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$683, DW_AT_name("regionInitEnable")
	.dwattr $C$DW$683, DW_AT_TI_symbol_name("regionInitEnable")
	.dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$683, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$683, DW_AT_decl_line(0x304)
	.dwattr $C$DW$683, DW_AT_decl_column(0x12)
$C$DW$684	.dwtag  DW_TAG_member
	.dwattr $C$DW$684, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$684, DW_AT_name("gblerrCbParams")
	.dwattr $C$DW$684, DW_AT_TI_symbol_name("gblerrCbParams")
	.dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$684, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$684, DW_AT_decl_line(0x307)
	.dwattr $C$DW$684, DW_AT_decl_column(0x25)
	.dwendtag $C$DW$T$167

	.dwattr $C$DW$T$167, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$T$167, DW_AT_decl_line(0x2e5)
	.dwattr $C$DW$T$167, DW_AT_decl_column(0x10)
$C$DW$T$633	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_RM_Param")
	.dwattr $C$DW$T$633, DW_AT_type(*$C$DW$T$167)
	.dwattr $C$DW$T$633, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$633, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$T$633, DW_AT_decl_line(0x308)
	.dwattr $C$DW$T$633, DW_AT_decl_column(0x03)

$C$DW$T$168	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$168, DW_AT_byte_size(0x04)
$C$DW$685	.dwtag  DW_TAG_member
	.dwattr $C$DW$685, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$685, DW_AT_name("isSlave")
	.dwattr $C$DW$685, DW_AT_TI_symbol_name("isSlave")
	.dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$685, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$685, DW_AT_decl_line(0x319)
	.dwattr $C$DW$685, DW_AT_decl_column(0x17)
$C$DW$686	.dwtag  DW_TAG_member
	.dwattr $C$DW$686, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$686, DW_AT_name("param")
	.dwattr $C$DW$686, DW_AT_TI_symbol_name("param")
	.dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$686, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$686, DW_AT_decl_line(0x31c)
	.dwattr $C$DW$686, DW_AT_decl_column(0x17)
	.dwendtag $C$DW$T$168

	.dwattr $C$DW$T$168, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$T$168, DW_AT_decl_line(0x312)
	.dwattr $C$DW$T$168, DW_AT_decl_column(0x10)
$C$DW$T$634	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_RM_MiscParam")
	.dwattr $C$DW$T$634, DW_AT_type(*$C$DW$T$168)
	.dwattr $C$DW$T$634, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$634, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$T$634, DW_AT_decl_line(0x31d)
	.dwattr $C$DW$T$634, DW_AT_decl_column(0x02)

$C$DW$T$169	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$169, DW_AT_byte_size(0x20)
$C$DW$687	.dwtag  DW_TAG_member
	.dwattr $C$DW$687, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$687, DW_AT_name("OPT")
	.dwattr $C$DW$687, DW_AT_TI_symbol_name("OPT")
	.dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$687, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$687, DW_AT_decl_line(0x5a9)
	.dwattr $C$DW$687, DW_AT_decl_column(0x17)
$C$DW$688	.dwtag  DW_TAG_member
	.dwattr $C$DW$688, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$688, DW_AT_name("SRC")
	.dwattr $C$DW$688, DW_AT_TI_symbol_name("SRC")
	.dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$688, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$688, DW_AT_decl_line(0x5af)
	.dwattr $C$DW$688, DW_AT_decl_column(0x17)
$C$DW$689	.dwtag  DW_TAG_member
	.dwattr $C$DW$689, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$689, DW_AT_name("A_B_CNT")
	.dwattr $C$DW$689, DW_AT_TI_symbol_name("A_B_CNT")
	.dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$689, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$689, DW_AT_decl_line(0x5b5)
	.dwattr $C$DW$689, DW_AT_decl_column(0x17)
$C$DW$690	.dwtag  DW_TAG_member
	.dwattr $C$DW$690, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$690, DW_AT_name("DST")
	.dwattr $C$DW$690, DW_AT_TI_symbol_name("DST")
	.dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$690, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$690, DW_AT_decl_line(0x5bc)
	.dwattr $C$DW$690, DW_AT_decl_column(0x17)
$C$DW$691	.dwtag  DW_TAG_member
	.dwattr $C$DW$691, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$691, DW_AT_name("SRC_DST_BIDX")
	.dwattr $C$DW$691, DW_AT_TI_symbol_name("SRC_DST_BIDX")
	.dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$691, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$691, DW_AT_decl_line(0x5c8)
	.dwattr $C$DW$691, DW_AT_decl_column(0x17)
$C$DW$692	.dwtag  DW_TAG_member
	.dwattr $C$DW$692, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$692, DW_AT_name("LINK_BCNTRLD")
	.dwattr $C$DW$692, DW_AT_TI_symbol_name("LINK_BCNTRLD")
	.dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$692, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$692, DW_AT_decl_line(0x5d3)
	.dwattr $C$DW$692, DW_AT_decl_column(0x17)
$C$DW$693	.dwtag  DW_TAG_member
	.dwattr $C$DW$693, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$693, DW_AT_name("SRC_DST_CIDX")
	.dwattr $C$DW$693, DW_AT_TI_symbol_name("SRC_DST_CIDX")
	.dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$693, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$693, DW_AT_decl_line(0x5da)
	.dwattr $C$DW$693, DW_AT_decl_column(0x17)
$C$DW$694	.dwtag  DW_TAG_member
	.dwattr $C$DW$694, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$694, DW_AT_name("CCNT")
	.dwattr $C$DW$694, DW_AT_TI_symbol_name("CCNT")
	.dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$694, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$694, DW_AT_decl_line(0x5df)
	.dwattr $C$DW$694, DW_AT_decl_column(0x17)
	.dwendtag $C$DW$T$169

	.dwattr $C$DW$T$169, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$T$169, DW_AT_decl_line(0x5a7)
	.dwattr $C$DW$T$169, DW_AT_decl_column(0x11)
$C$DW$T$635	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_RM_ParamentryRegs")
	.dwattr $C$DW$T$635, DW_AT_type(*$C$DW$T$169)
	.dwattr $C$DW$T$635, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$635, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$T$635, DW_AT_decl_line(0x5e0)
	.dwattr $C$DW$T$635, DW_AT_decl_column(0x03)

$C$DW$T$170	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$170, DW_AT_byte_size(0x20)
$C$DW$695	.dwtag  DW_TAG_member
	.dwattr $C$DW$695, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$695, DW_AT_name("opt")
	.dwattr $C$DW$695, DW_AT_TI_symbol_name("opt")
	.dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$695, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$695, DW_AT_decl_line(0x5ec)
	.dwattr $C$DW$695, DW_AT_decl_column(0x1b)
$C$DW$696	.dwtag  DW_TAG_member
	.dwattr $C$DW$696, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$696, DW_AT_name("srcAddr")
	.dwattr $C$DW$696, DW_AT_TI_symbol_name("srcAddr")
	.dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$696, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$696, DW_AT_decl_line(0x5f2)
	.dwattr $C$DW$696, DW_AT_decl_column(0x1b)
$C$DW$697	.dwtag  DW_TAG_member
	.dwattr $C$DW$697, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$697, DW_AT_name("aCnt")
	.dwattr $C$DW$697, DW_AT_TI_symbol_name("aCnt")
	.dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$697, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$697, DW_AT_decl_line(0x5f7)
	.dwattr $C$DW$697, DW_AT_decl_column(0x1b)
$C$DW$698	.dwtag  DW_TAG_member
	.dwattr $C$DW$698, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$698, DW_AT_name("bCnt")
	.dwattr $C$DW$698, DW_AT_TI_symbol_name("bCnt")
	.dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$698, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$698, DW_AT_decl_line(0x5fc)
	.dwattr $C$DW$698, DW_AT_decl_column(0x1b)
$C$DW$699	.dwtag  DW_TAG_member
	.dwattr $C$DW$699, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$699, DW_AT_name("destAddr")
	.dwattr $C$DW$699, DW_AT_TI_symbol_name("destAddr")
	.dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$699, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$699, DW_AT_decl_line(0x603)
	.dwattr $C$DW$699, DW_AT_decl_column(0x1b)
$C$DW$700	.dwtag  DW_TAG_member
	.dwattr $C$DW$700, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$700, DW_AT_name("srcBIdx")
	.dwattr $C$DW$700, DW_AT_TI_symbol_name("srcBIdx")
	.dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$700, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$700, DW_AT_decl_line(0x60a)
	.dwattr $C$DW$700, DW_AT_decl_column(0x1b)
$C$DW$701	.dwtag  DW_TAG_member
	.dwattr $C$DW$701, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$701, DW_AT_name("destBIdx")
	.dwattr $C$DW$701, DW_AT_TI_symbol_name("destBIdx")
	.dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$701, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$701, DW_AT_decl_line(0x611)
	.dwattr $C$DW$701, DW_AT_decl_column(0x1b)
$C$DW$702	.dwtag  DW_TAG_member
	.dwattr $C$DW$702, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$702, DW_AT_name("linkAddr")
	.dwattr $C$DW$702, DW_AT_TI_symbol_name("linkAddr")
	.dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$702, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$702, DW_AT_decl_line(0x61a)
	.dwattr $C$DW$702, DW_AT_decl_column(0x1b)
$C$DW$703	.dwtag  DW_TAG_member
	.dwattr $C$DW$703, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$703, DW_AT_name("bCntReload")
	.dwattr $C$DW$703, DW_AT_TI_symbol_name("bCntReload")
	.dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$703, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$703, DW_AT_decl_line(0x620)
	.dwattr $C$DW$703, DW_AT_decl_column(0x1b)
$C$DW$704	.dwtag  DW_TAG_member
	.dwattr $C$DW$704, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$704, DW_AT_name("srcCIdx")
	.dwattr $C$DW$704, DW_AT_TI_symbol_name("srcCIdx")
	.dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$704, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$704, DW_AT_decl_line(0x625)
	.dwattr $C$DW$704, DW_AT_decl_column(0x1b)
$C$DW$705	.dwtag  DW_TAG_member
	.dwattr $C$DW$705, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$705, DW_AT_name("destCIdx")
	.dwattr $C$DW$705, DW_AT_TI_symbol_name("destCIdx")
	.dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$705, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$705, DW_AT_decl_line(0x62a)
	.dwattr $C$DW$705, DW_AT_decl_column(0x1b)
$C$DW$706	.dwtag  DW_TAG_member
	.dwattr $C$DW$706, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$706, DW_AT_name("cCnt")
	.dwattr $C$DW$706, DW_AT_TI_symbol_name("cCnt")
	.dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$706, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$706, DW_AT_decl_line(0x62f)
	.dwattr $C$DW$706, DW_AT_decl_column(0x1b)
$C$DW$707	.dwtag  DW_TAG_member
	.dwattr $C$DW$707, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$707, DW_AT_name("reserved")
	.dwattr $C$DW$707, DW_AT_TI_symbol_name("reserved")
	.dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$707, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$707, DW_AT_decl_line(0x634)
	.dwattr $C$DW$707, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$170

	.dwattr $C$DW$T$170, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$T$170, DW_AT_decl_line(0x5ea)
	.dwattr $C$DW$T$170, DW_AT_decl_column(0x11)
$C$DW$T$636	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_RM_PaRAMRegs")
	.dwattr $C$DW$T$636, DW_AT_type(*$C$DW$T$170)
	.dwattr $C$DW$T$636, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$636, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$T$636, DW_AT_decl_line(0x635)
	.dwattr $C$DW$T$636, DW_AT_decl_column(0x03)

$C$DW$T$173	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$173, DW_AT_byte_size(0x7c)
$C$DW$708	.dwtag  DW_TAG_member
	.dwattr $C$DW$708, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$708, DW_AT_name("dmaMapXbarToChan")
	.dwattr $C$DW$708, DW_AT_TI_symbol_name("dmaMapXbarToChan")
	.dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$708, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$708, DW_AT_decl_line(0x89c)
	.dwattr $C$DW$708, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$173

	.dwattr $C$DW$T$173, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$T$173, DW_AT_decl_line(0x88f)
	.dwattr $C$DW$T$173, DW_AT_decl_column(0x11)
$C$DW$T$637	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_RM_GblXbarToChanConfigParams")
	.dwattr $C$DW$T$637, DW_AT_type(*$C$DW$T$173)
	.dwattr $C$DW$T$637, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$637, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/rm/edma3_rm.h")
	.dwattr $C$DW$T$637, DW_AT_decl_line(0x89d)
	.dwattr $C$DW$T$637, DW_AT_decl_column(0x07)
$C$DW$T$638	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$638, DW_AT_type(*$C$DW$T$637)
$C$DW$T$639	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$639, DW_AT_type(*$C$DW$T$638)
	.dwattr $C$DW$T$639, DW_AT_address_class(0x20)

$C$DW$T$174	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$174, DW_AT_byte_size(0x2d8)
$C$DW$709	.dwtag  DW_TAG_member
	.dwattr $C$DW$709, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$709, DW_AT_name("numDmaChannels")
	.dwattr $C$DW$709, DW_AT_TI_symbol_name("numDmaChannels")
	.dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$709, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$709, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$709, DW_AT_decl_column(0x15)
$C$DW$710	.dwtag  DW_TAG_member
	.dwattr $C$DW$710, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$710, DW_AT_name("numQdmaChannels")
	.dwattr $C$DW$710, DW_AT_TI_symbol_name("numQdmaChannels")
	.dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$710, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$710, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$710, DW_AT_decl_column(0x15)
$C$DW$711	.dwtag  DW_TAG_member
	.dwattr $C$DW$711, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$711, DW_AT_name("numTccs")
	.dwattr $C$DW$711, DW_AT_TI_symbol_name("numTccs")
	.dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$711, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$711, DW_AT_decl_line(0xef)
	.dwattr $C$DW$711, DW_AT_decl_column(0x15)
$C$DW$712	.dwtag  DW_TAG_member
	.dwattr $C$DW$712, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$712, DW_AT_name("numPaRAMSets")
	.dwattr $C$DW$712, DW_AT_TI_symbol_name("numPaRAMSets")
	.dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$712, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$712, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$712, DW_AT_decl_column(0x15)
$C$DW$713	.dwtag  DW_TAG_member
	.dwattr $C$DW$713, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$713, DW_AT_name("numEvtQueue")
	.dwattr $C$DW$713, DW_AT_TI_symbol_name("numEvtQueue")
	.dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$713, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$713, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$713, DW_AT_decl_column(0x15)
$C$DW$714	.dwtag  DW_TAG_member
	.dwattr $C$DW$714, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$714, DW_AT_name("numTcs")
	.dwattr $C$DW$714, DW_AT_TI_symbol_name("numTcs")
	.dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$714, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$714, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$714, DW_AT_decl_column(0x15)
$C$DW$715	.dwtag  DW_TAG_member
	.dwattr $C$DW$715, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$715, DW_AT_name("numRegions")
	.dwattr $C$DW$715, DW_AT_TI_symbol_name("numRegions")
	.dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$715, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$715, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$715, DW_AT_decl_column(0x15)
$C$DW$716	.dwtag  DW_TAG_member
	.dwattr $C$DW$716, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$716, DW_AT_name("dmaChPaRAMMapExists")
	.dwattr $C$DW$716, DW_AT_TI_symbol_name("dmaChPaRAMMapExists")
	.dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$716, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$716, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$716, DW_AT_decl_column(0x0f)
$C$DW$717	.dwtag  DW_TAG_member
	.dwattr $C$DW$717, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$717, DW_AT_name("memProtectionExists")
	.dwattr $C$DW$717, DW_AT_TI_symbol_name("memProtectionExists")
	.dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$717, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$717, DW_AT_decl_line(0x10f)
	.dwattr $C$DW$717, DW_AT_decl_column(0x0f)
$C$DW$718	.dwtag  DW_TAG_member
	.dwattr $C$DW$718, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$718, DW_AT_name("globalRegs")
	.dwattr $C$DW$718, DW_AT_TI_symbol_name("globalRegs")
	.dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$718, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$718, DW_AT_decl_line(0x112)
	.dwattr $C$DW$718, DW_AT_decl_column(0x1a)
$C$DW$719	.dwtag  DW_TAG_member
	.dwattr $C$DW$719, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$719, DW_AT_name("tcRegs")
	.dwattr $C$DW$719, DW_AT_TI_symbol_name("tcRegs")
	.dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$719, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$719, DW_AT_decl_line(0x115)
	.dwattr $C$DW$719, DW_AT_decl_column(0x1a)
$C$DW$720	.dwtag  DW_TAG_member
	.dwattr $C$DW$720, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$720, DW_AT_name("xferCompleteInt")
	.dwattr $C$DW$720, DW_AT_TI_symbol_name("xferCompleteInt")
	.dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$720, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$720, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$720, DW_AT_decl_column(0x15)
$C$DW$721	.dwtag  DW_TAG_member
	.dwattr $C$DW$721, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$721, DW_AT_name("ccError")
	.dwattr $C$DW$721, DW_AT_TI_symbol_name("ccError")
	.dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$721, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$721, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$721, DW_AT_decl_column(0x15)
$C$DW$722	.dwtag  DW_TAG_member
	.dwattr $C$DW$722, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$722, DW_AT_name("tcError")
	.dwattr $C$DW$722, DW_AT_TI_symbol_name("tcError")
	.dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$722, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$722, DW_AT_decl_line(0x121)
	.dwattr $C$DW$722, DW_AT_decl_column(0x15)
$C$DW$723	.dwtag  DW_TAG_member
	.dwattr $C$DW$723, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$723, DW_AT_name("evtQPri")
	.dwattr $C$DW$723, DW_AT_TI_symbol_name("evtQPri")
	.dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$723, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$723, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$723, DW_AT_decl_column(0x15)
$C$DW$724	.dwtag  DW_TAG_member
	.dwattr $C$DW$724, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$724, DW_AT_name("evtQueueWaterMarkLvl")
	.dwattr $C$DW$724, DW_AT_TI_symbol_name("evtQueueWaterMarkLvl")
	.dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$724, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$724, DW_AT_decl_line(0x138)
	.dwattr $C$DW$724, DW_AT_decl_column(0x15)
$C$DW$725	.dwtag  DW_TAG_member
	.dwattr $C$DW$725, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$725, DW_AT_name("tcDefaultBurstSize")
	.dwattr $C$DW$725, DW_AT_TI_symbol_name("tcDefaultBurstSize")
	.dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
	.dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$725, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$725, DW_AT_decl_line(0x141)
	.dwattr $C$DW$725, DW_AT_decl_column(0x15)
$C$DW$726	.dwtag  DW_TAG_member
	.dwattr $C$DW$726, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$726, DW_AT_name("dmaChannelPaRAMMap")
	.dwattr $C$DW$726, DW_AT_TI_symbol_name("dmaChannelPaRAMMap")
	.dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
	.dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$726, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$726, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$726, DW_AT_decl_column(0x15)
$C$DW$727	.dwtag  DW_TAG_member
	.dwattr $C$DW$727, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$727, DW_AT_name("dmaChannelTccMap")
	.dwattr $C$DW$727, DW_AT_TI_symbol_name("dmaChannelTccMap")
	.dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d0]
	.dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$727, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$727, DW_AT_decl_line(0x159)
	.dwattr $C$DW$727, DW_AT_decl_column(0x15)
$C$DW$728	.dwtag  DW_TAG_member
	.dwattr $C$DW$728, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$728, DW_AT_name("dmaChannelHwEvtMap")
	.dwattr $C$DW$728, DW_AT_TI_symbol_name("dmaChannelHwEvtMap")
	.dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d0]
	.dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$728, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$728, DW_AT_decl_line(0x167)
	.dwattr $C$DW$728, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$174

	.dwattr $C$DW$T$174, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$174, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$174, DW_AT_decl_column(0x11)
$C$DW$T$640	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_DRV_GblConfigParams")
	.dwattr $C$DW$T$640, DW_AT_type(*$C$DW$T$174)
	.dwattr $C$DW$T$640, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$640, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$640, DW_AT_decl_line(0x168)
	.dwattr $C$DW$T$640, DW_AT_decl_column(0x07)

$C$DW$T$175	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$175, DW_AT_byte_size(0xa8)
$C$DW$729	.dwtag  DW_TAG_member
	.dwattr $C$DW$729, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$729, DW_AT_name("ownPaRAMSets")
	.dwattr $C$DW$729, DW_AT_TI_symbol_name("ownPaRAMSets")
	.dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$729, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$729, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$729, DW_AT_decl_column(0x15)
$C$DW$730	.dwtag  DW_TAG_member
	.dwattr $C$DW$730, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$730, DW_AT_name("ownDmaChannels")
	.dwattr $C$DW$730, DW_AT_TI_symbol_name("ownDmaChannels")
	.dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$730, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$730, DW_AT_decl_line(0x1af)
	.dwattr $C$DW$730, DW_AT_decl_column(0x15)
$C$DW$731	.dwtag  DW_TAG_member
	.dwattr $C$DW$731, DW_AT_type(*$C$DW$T$161)
	.dwattr $C$DW$731, DW_AT_name("ownQdmaChannels")
	.dwattr $C$DW$731, DW_AT_TI_symbol_name("ownQdmaChannels")
	.dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$731, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$731, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$731, DW_AT_decl_column(0x15)
$C$DW$732	.dwtag  DW_TAG_member
	.dwattr $C$DW$732, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$732, DW_AT_name("ownTccs")
	.dwattr $C$DW$732, DW_AT_TI_symbol_name("ownTccs")
	.dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$732, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$732, DW_AT_decl_line(0x1b5)
	.dwattr $C$DW$732, DW_AT_decl_column(0x15)
$C$DW$733	.dwtag  DW_TAG_member
	.dwattr $C$DW$733, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$733, DW_AT_name("resvdPaRAMSets")
	.dwattr $C$DW$733, DW_AT_TI_symbol_name("resvdPaRAMSets")
	.dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$733, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$733, DW_AT_decl_line(0x1be)
	.dwattr $C$DW$733, DW_AT_decl_column(0x15)
$C$DW$734	.dwtag  DW_TAG_member
	.dwattr $C$DW$734, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$734, DW_AT_name("resvdDmaChannels")
	.dwattr $C$DW$734, DW_AT_TI_symbol_name("resvdDmaChannels")
	.dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
	.dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$734, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$734, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$734, DW_AT_decl_column(0x15)
$C$DW$735	.dwtag  DW_TAG_member
	.dwattr $C$DW$735, DW_AT_type(*$C$DW$T$161)
	.dwattr $C$DW$735, DW_AT_name("resvdQdmaChannels")
	.dwattr $C$DW$735, DW_AT_TI_symbol_name("resvdQdmaChannels")
	.dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
	.dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$735, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$735, DW_AT_decl_line(0x1d0)
	.dwattr $C$DW$735, DW_AT_decl_column(0x15)
$C$DW$736	.dwtag  DW_TAG_member
	.dwattr $C$DW$736, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$736, DW_AT_name("resvdTccs")
	.dwattr $C$DW$736, DW_AT_TI_symbol_name("resvdTccs")
	.dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
	.dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$736, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$736, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$736, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$175

	.dwattr $C$DW$T$175, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$175, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$T$175, DW_AT_decl_column(0x01)
$C$DW$T$176	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_DRV_InstanceInitConfig")
	.dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$175)
	.dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$176, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$176, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$T$176, DW_AT_decl_column(0x02)
$C$DW$T$177	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$176)
	.dwattr $C$DW$T$177, DW_AT_address_class(0x20)

$C$DW$T$178	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$178, DW_AT_byte_size(0x18)
$C$DW$737	.dwtag  DW_TAG_member
	.dwattr $C$DW$737, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$737, DW_AT_name("regionId")
	.dwattr $C$DW$737, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$737, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$737, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$737, DW_AT_decl_column(0x1d)
$C$DW$738	.dwtag  DW_TAG_member
	.dwattr $C$DW$738, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$738, DW_AT_name("isMaster")
	.dwattr $C$DW$738, DW_AT_TI_symbol_name("isMaster")
	.dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$738, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$738, DW_AT_decl_line(0x1ec)
	.dwattr $C$DW$738, DW_AT_decl_column(0x10)
$C$DW$739	.dwtag  DW_TAG_member
	.dwattr $C$DW$739, DW_AT_type(*$C$DW$T$177)
	.dwattr $C$DW$739, DW_AT_name("drvInstInitConfig")
	.dwattr $C$DW$739, DW_AT_TI_symbol_name("drvInstInitConfig")
	.dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$739, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$739, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$739, DW_AT_decl_column(0x26)
$C$DW$740	.dwtag  DW_TAG_member
	.dwattr $C$DW$740, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$740, DW_AT_name("drvSemHandle")
	.dwattr $C$DW$740, DW_AT_TI_symbol_name("drvSemHandle")
	.dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$740, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$740, DW_AT_decl_line(0x1fd)
	.dwattr $C$DW$740, DW_AT_decl_column(0x1e)
$C$DW$741	.dwtag  DW_TAG_member
	.dwattr $C$DW$741, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$741, DW_AT_name("gblerrCb")
	.dwattr $C$DW$741, DW_AT_TI_symbol_name("gblerrCb")
	.dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$741, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$741, DW_AT_decl_line(0x204)
	.dwattr $C$DW$741, DW_AT_decl_column(0x1d)
$C$DW$742	.dwtag  DW_TAG_member
	.dwattr $C$DW$742, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$742, DW_AT_name("gblerrData")
	.dwattr $C$DW$742, DW_AT_TI_symbol_name("gblerrData")
	.dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$742, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$742, DW_AT_decl_line(0x20a)
	.dwattr $C$DW$742, DW_AT_decl_column(0x1e)
	.dwendtag $C$DW$T$178

	.dwattr $C$DW$T$178, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$178, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$T$178, DW_AT_decl_column(0x01)
$C$DW$T$641	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_DRV_InitConfig")
	.dwattr $C$DW$T$641, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$T$641, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$641, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$641, DW_AT_decl_line(0x20b)
	.dwattr $C$DW$T$641, DW_AT_decl_column(0x03)

$C$DW$T$179	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$179, DW_AT_byte_size(0x04)
$C$DW$743	.dwtag  DW_TAG_member
	.dwattr $C$DW$743, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$743, DW_AT_name("isSlave")
	.dwattr $C$DW$743, DW_AT_TI_symbol_name("isSlave")
	.dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$743, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$743, DW_AT_decl_line(0x21c)
	.dwattr $C$DW$743, DW_AT_decl_column(0x17)
$C$DW$744	.dwtag  DW_TAG_member
	.dwattr $C$DW$744, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$744, DW_AT_name("param")
	.dwattr $C$DW$744, DW_AT_TI_symbol_name("param")
	.dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$744, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$744, DW_AT_decl_line(0x21f)
	.dwattr $C$DW$744, DW_AT_decl_column(0x17)
	.dwendtag $C$DW$T$179

	.dwattr $C$DW$T$179, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$179, DW_AT_decl_line(0x215)
	.dwattr $C$DW$T$179, DW_AT_decl_column(0x10)
$C$DW$T$642	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_DRV_MiscParam")
	.dwattr $C$DW$T$642, DW_AT_type(*$C$DW$T$179)
	.dwattr $C$DW$T$642, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$642, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$642, DW_AT_decl_line(0x220)
	.dwattr $C$DW$T$642, DW_AT_decl_column(0x02)

$C$DW$T$188	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$188, DW_AT_byte_size(0x10)
$C$DW$745	.dwtag  DW_TAG_member
	.dwattr $C$DW$745, DW_AT_type(*$C$DW$T$181)
	.dwattr $C$DW$745, DW_AT_name("tcchEn")
	.dwattr $C$DW$745, DW_AT_TI_symbol_name("tcchEn")
	.dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$745, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$745, DW_AT_decl_line(0x5d6)
	.dwattr $C$DW$745, DW_AT_decl_column(0x19)
$C$DW$746	.dwtag  DW_TAG_member
	.dwattr $C$DW$746, DW_AT_type(*$C$DW$T$183)
	.dwattr $C$DW$746, DW_AT_name("itcchEn")
	.dwattr $C$DW$746, DW_AT_TI_symbol_name("itcchEn")
	.dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$746, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$746, DW_AT_decl_line(0x5d9)
	.dwattr $C$DW$746, DW_AT_decl_column(0x19)
$C$DW$747	.dwtag  DW_TAG_member
	.dwattr $C$DW$747, DW_AT_type(*$C$DW$T$185)
	.dwattr $C$DW$747, DW_AT_name("tcintEn")
	.dwattr $C$DW$747, DW_AT_TI_symbol_name("tcintEn")
	.dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$747, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$747, DW_AT_decl_line(0x5dc)
	.dwattr $C$DW$747, DW_AT_decl_column(0x19)
$C$DW$748	.dwtag  DW_TAG_member
	.dwattr $C$DW$748, DW_AT_type(*$C$DW$T$187)
	.dwattr $C$DW$748, DW_AT_name("itcintEn")
	.dwattr $C$DW$748, DW_AT_TI_symbol_name("itcintEn")
	.dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$748, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$748, DW_AT_decl_line(0x5df)
	.dwattr $C$DW$748, DW_AT_decl_column(0x19)
	.dwendtag $C$DW$T$188

	.dwattr $C$DW$T$188, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$188, DW_AT_decl_line(0x5d4)
	.dwattr $C$DW$T$188, DW_AT_decl_column(0x01)
$C$DW$T$643	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_DRV_ChainOptions")
	.dwattr $C$DW$T$643, DW_AT_type(*$C$DW$T$188)
	.dwattr $C$DW$T$643, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$643, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$643, DW_AT_decl_line(0x5e0)
	.dwattr $C$DW$T$643, DW_AT_decl_column(0x03)

$C$DW$T$189	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$189, DW_AT_byte_size(0x20)
$C$DW$749	.dwtag  DW_TAG_member
	.dwattr $C$DW$749, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$749, DW_AT_name("OPT")
	.dwattr $C$DW$749, DW_AT_TI_symbol_name("OPT")
	.dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$749, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$749, DW_AT_decl_line(0x855)
	.dwattr $C$DW$749, DW_AT_decl_column(0x17)
$C$DW$750	.dwtag  DW_TAG_member
	.dwattr $C$DW$750, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$750, DW_AT_name("SRC")
	.dwattr $C$DW$750, DW_AT_TI_symbol_name("SRC")
	.dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$750, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$750, DW_AT_decl_line(0x85b)
	.dwattr $C$DW$750, DW_AT_decl_column(0x17)
$C$DW$751	.dwtag  DW_TAG_member
	.dwattr $C$DW$751, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$751, DW_AT_name("A_B_CNT")
	.dwattr $C$DW$751, DW_AT_TI_symbol_name("A_B_CNT")
	.dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$751, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$751, DW_AT_decl_line(0x861)
	.dwattr $C$DW$751, DW_AT_decl_column(0x17)
$C$DW$752	.dwtag  DW_TAG_member
	.dwattr $C$DW$752, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$752, DW_AT_name("DST")
	.dwattr $C$DW$752, DW_AT_TI_symbol_name("DST")
	.dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$752, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$752, DW_AT_decl_line(0x868)
	.dwattr $C$DW$752, DW_AT_decl_column(0x17)
$C$DW$753	.dwtag  DW_TAG_member
	.dwattr $C$DW$753, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$753, DW_AT_name("SRC_DST_BIDX")
	.dwattr $C$DW$753, DW_AT_TI_symbol_name("SRC_DST_BIDX")
	.dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$753, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$753, DW_AT_decl_line(0x874)
	.dwattr $C$DW$753, DW_AT_decl_column(0x17)
$C$DW$754	.dwtag  DW_TAG_member
	.dwattr $C$DW$754, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$754, DW_AT_name("LINK_BCNTRLD")
	.dwattr $C$DW$754, DW_AT_TI_symbol_name("LINK_BCNTRLD")
	.dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$754, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$754, DW_AT_decl_line(0x87f)
	.dwattr $C$DW$754, DW_AT_decl_column(0x17)
$C$DW$755	.dwtag  DW_TAG_member
	.dwattr $C$DW$755, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$755, DW_AT_name("SRC_DST_CIDX")
	.dwattr $C$DW$755, DW_AT_TI_symbol_name("SRC_DST_CIDX")
	.dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$755, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$755, DW_AT_decl_line(0x886)
	.dwattr $C$DW$755, DW_AT_decl_column(0x17)
$C$DW$756	.dwtag  DW_TAG_member
	.dwattr $C$DW$756, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$756, DW_AT_name("CCNT")
	.dwattr $C$DW$756, DW_AT_TI_symbol_name("CCNT")
	.dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$756, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$756, DW_AT_decl_line(0x88b)
	.dwattr $C$DW$756, DW_AT_decl_column(0x17)
	.dwendtag $C$DW$T$189

	.dwattr $C$DW$T$189, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$189, DW_AT_decl_line(0x853)
	.dwattr $C$DW$T$189, DW_AT_decl_column(0x11)
$C$DW$T$644	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_DRV_ParamentryRegs")
	.dwattr $C$DW$T$644, DW_AT_type(*$C$DW$T$189)
	.dwattr $C$DW$T$644, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$644, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$644, DW_AT_decl_line(0x88d)
	.dwattr $C$DW$T$644, DW_AT_decl_column(0x03)

$C$DW$T$190	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$190, DW_AT_byte_size(0x20)
$C$DW$757	.dwtag  DW_TAG_member
	.dwattr $C$DW$757, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$757, DW_AT_name("evtQPri")
	.dwattr $C$DW$757, DW_AT_TI_symbol_name("evtQPri")
	.dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$757, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$757, DW_AT_decl_line(0x93f)
	.dwattr $C$DW$757, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$190

	.dwattr $C$DW$T$190, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$190, DW_AT_decl_line(0x93b)
	.dwattr $C$DW$T$190, DW_AT_decl_column(0x01)
$C$DW$T$645	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA3_DRV_EvtQuePriority")
	.dwattr $C$DW$T$645, DW_AT_type(*$C$DW$T$190)
	.dwattr $C$DW$T$645, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$645, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$645, DW_AT_decl_line(0x940)
	.dwattr $C$DW$T$645, DW_AT_decl_column(0x02)

$C$DW$T$192	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$192, DW_AT_byte_size(0xfc)
$C$DW$758	.dwtag  DW_TAG_member
	.dwattr $C$DW$758, DW_AT_type(*$C$DW$T$191)
	.dwattr $C$DW$758, DW_AT_name("dmaMapXbarToChan")
	.dwattr $C$DW$758, DW_AT_TI_symbol_name("dmaMapXbarToChan")
	.dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$758, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$758, DW_AT_decl_line(0xc04)
	.dwattr $C$DW$758, DW_AT_decl_column(0x14)
	.dwendtag $C$DW$T$192

	.dwattr $C$DW$T$192, DW_AT_decl_file("I:/J5eco_DSP_Project_GA-R1.1_20141120/J5eco_DSP_Project_R1.1/av_bios_sdk_00_10_00_00/edma3_lld_02_11_06_01/packages/ti/sdo/edma3/drv/edma3_drv.h")
	.dwattr $C$DW$T$192, DW_AT_decl_line(0xbf7)
	.dwattr $C$DW$T$192, DW_AT_decl_column(0x11)
